native/model/data/metro-track-info-query.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
<getTrackInfo xmlns="http://tempuri.org/">
<userName>USERNAME</userName>
<passWord>PASSWORD</passWord>
</getTrackInfo>
</soap:Body>
</soap:Envelope>
